app/Controllers/TaskController.php

    public function main()
    {
        $model = new TaskModel();
        $tasks = $model->where('user_id', session()->get('user_id'))->findAll();
---
SELECT *
FROM `tasks`
WHERE `user_id` = '15'

    public function store($id = null)
    {
        $model = new TaskModel();

        // Validate the input data
        if (!$this->validate($model->validationRules)) {
            // If validation fails, return the form with errors
            return view('tasks/create', [
                'validation' => $this->validator,
                'task' => null
            ]);
        }

        // Find the input data. status	priority	due_date
        $taskData = [
            'user_id'     => session()->get('user_id'),
            'title'       => $this->request->getPost('title'),
            'description' => $this->request->getPost('description'),
            'status'      => $this->request->getPost('status'),
            'priority'    => $this->request->getPost('priority'),
            'due_date'    => $this->request->getPost('due_date'),
        ];

        if ($id == null) {
            // Use the Model's validate() method to check validation rules
            if ($model->save($taskData)) {
---
INSERT INTO `tasks` (`user_id`, `title`, `description`, `status`, `priority`, `due_date`, `created_at`, `updated_at`) VALUES ('15', '123', 'assad', 'pending', 'low', '2024-11-23', '2024-11-22 12:31:40', '2024-11-22 12:31:40')