app/Controllers/UserController.php

SELECT *
FROM `users`
---
    public function main()
    {
        $model = new UserModel();
        $data['users'] = $model->findAll();