app/Models/AdminModel.php

    public function validateAdminCredentials($email, $password)
    {
        $admin = $this->where('email', $email)->first();
---
SELECT *
FROM `admin`
WHERE `email` = 'a@gmail.com'
 LIMIT 1